; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (p5 ?x)
               (p2 ?x)
               (p3)
               (p1 ?x)
               (p4 ?x ?y))

  (:action a3
    :parameters (?ob)
    :precondition (and (p5 ?ob) (p2 ?ob) (p3))
    :effect (and (p1 ?ob) (not (p5 ?ob)) (not (p2 ?ob)) 
                 (not (p3))))

  (:action a1
    :parameters  (?ob)
    :precondition (p1 ?ob)
    :effect (and (p5 ?ob) (p3) (p2 ?ob) 
                 (not (p1 ?ob))))

  (:action a4
    :parameters  (?ob ?underob)
    :precondition (and (p5 ?underob) (p1 ?ob))
    :effect (and (p3) (p5 ?ob) (p4 ?ob ?underob)
                 (not (p5 ?underob)) (not (p1 ?ob))))

  (:action a2
    :parameters  (?ob ?underob)
    :precondition (and (p4 ?ob ?underob) (p5 ?ob) (p3))
    :effect (and (p1 ?ob) (p5 ?underob)
                 (not (p4 ?ob ?underob)) (not (p5 ?ob)) (not (p3)))))

; problem
(define (problem BW-rand-3)
(:domain blocksworld)
(:objects o3 o2 o1 )
(:init
(p3)
(p2 o3)
(p2 o2)
(p4 o1 o3)
(p5 o2)
(p5 o1)
)
(:goal
(and
(p2 o3)
(p4 o2 o3)
(p4 o1 o2))
)

(:constraints
  (sometime-before (p4 o2 o3) (p2 o3))
)
)

; plan
1. (a2 o1 o3)
   deleted: (p4 o1 o3) (p5 o1) (p3)
   added: (p1 o1) (p5 o3)
   goals met: 1 of 3
2. (a1 o1)
   deleted: (p1 o1)
   added: (p5 o1) (p3) (p2 o1)
   goals met: 1 of 3
3. (a3 o2)
   deleted: (p5 o2) (p2 o2) (p3)
   added: (p1 o2)
   goals met: 1 of 3
4. (a4 o2 o3)
   deleted: (p5 o3) (p1 o2)
   added: (p3) (p5 o2) (p4 o2 o3)
   goals met: 2 of 3
5. (a3 o1)
   deleted: (p5 o1) (p2 o1) (p3)
   added: (p1 o1)
   goals met: 2 of 3
6. (a4 o1 o2)
   deleted: (p5 o2) (p1 o1)
   added: (p3) (p5 o1) (p4 o1 o2)
   goals met: 3 of 3
